Revit 2024 API
AlphanumericRevisionSettings.Suffix Property
 The suffix string that will be appended to the number of each revision with Alphanumeric RevisionNumberingType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public string Suffix { get; set; }
Visual Basic
Public Property Suffix As String
	Get
	Set
Visual C++
public:
property String^ Suffix {
	String^ get ();
	void set (String^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
AlphanumericRevisionSettings Class
Autodesk.Revit.DB Namespace